Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: obj := {} ; Creates an object.
ja: obj := {} ; オブジェクトを生成します。

source: of 32-bit signed integers and 0x400C identifies a pointer to a VARIANT.
ja: は 32 ビット符号付き整数、0x400C はVARIANTへのポインタを示します。

source: of this license document, but changing it is not allowed.
ja: 変更することはできません。

source: old_clip := ClipboardAll() ; Save all clipboard content
ja: old_clip := ClipboardAll() ; クリップボードの内容をすべて保存する

source: once as its old name and again as its new name.
ja: 旧名称ならば、新名称とします。

source: only one can be in effect at a time.
ja: 同時に1つだけ有効にすることができます。

source: only the one most recently specified will be in effect.
ja: 直近で指定されたものだけが有効になります。

source: priority level for the following window:
ja: 優先順位は、次のウィンドウで設定します：

source: ref1 := "" ; Release the first reference
ja: ref1 := "" ; 最初のリファレンスを公開します。

source: ref1 := Object() ; Create an object and store first reference
ja: ref1 := Object() ; オブジェクトを作成し、最初のリファレンスを格納します。

source: ref2 := "" ; Release the second reference; object is deleted
ja: ref2 := "" ; 2番目の参照を解除し、オブジェクトを削除します。

source: ref2 := ref1 ; Create a new reference to the same object
ja: ref2 := ref1 ; 同じオブジェクトへの新しい参照を作成します

source: reg(no): Same as above except that this hotkey is inactive (due to being unsupported, disabled, or suspended).
ja: reg(no)：このホットキーが非アクティブ（非対応、無効、または停止中であるため）であることを除いて、上記と同じです。

source: reg: The hotkey is implemented via the operating system's RegisterHotkey() function.
ja: reg：ホットキーは、オペレーティングシステムのRegisterHotkey()関数で実装されます。

source: return ; Do nothing.
ja: return ; 何もしません。

source: return ; This will exit in this case.
ja: return ; この場合、終了します。

source: return ; i.e. do nothing, which causes Ctrl+P to do nothing in Notepad.
ja: return ; つまり、何もしない。Ctrl+Pは、メモ帳では何もしません。

source: return ; IE not found.
ja: return ; IEが見つかりません。

source: return ; Outlook isn't open to the right section, so do nothing.
ja: return ; Outlookが適切なセクションで起動していないので、何もしません。

source: return ; i.e. Do nothing.
ja: return ; すなわち、何もしない。

source: return ; If No, stop the code from going further.
ja: return ; Noならここでコードを終了します。

source: return ; End this thread so that the one underneath will resume and see the change made by the line above.
ja: return ; このスレッドを終了すると、その下にあるスレッドが再開され、上の行で行われた変更を見ることができます。

source: return %Param% ; Explicitly dereference Param.
ja: return %Param% ; 明示的にParamをデリファレンスする。

source: return 0 ; Prevent main window from hiding.
ja: return 0 ; メインウィンドウが非表示にならないようにします。

source: return 0 ; Prevent owned window from minimizing.
ja: return 0 ; 所有するウィンドウが最小化されないようにします。

source: return ; Returning from a hotkey function ends the thread. Any underlying thread to be resumed is noncritical by definition.
ja: return ; ホットキー機能から戻ると、そのスレッドが終了します。再開される基礎となるスレッドは、定義上、非クリティカルなものです。

source: return ItemCount < MaxItems ; Returns a true or false value.
ja: return ItemCount < MaxItems ; trueまたはfalseを返します。

source: return Param ; ByRef parameters are automatically dereferenced.
ja: return Param ; ByRefパラメータは自動的に再参照される。

source: return TextBackgroundBrush ; Return the HBRUSH to notify the OS that we altered the HDC.
ja: return TextBackgroundBrush ; HDCを変更したことをOSに通知するため、HBRUSHを返す。

source: return false ; Tell our caller to stop searching.
ja: return false ; 発信者に検索をやめるように伝える。

source: return greet ; Return the closure.
ja: return greet ; クロージャーを返り値とします。

source: return true ; Returns the number 1 to mean "true".
ja: return true ; "true"を意味する数値1を返します。

source: return true ; Tell EnumWindows() to continue until all windows have been enumerated.
ja: return true ; EnumWindows() に、すべてのウィンドウが列挙されるまで続けるように指示します。

source: right POV
ja: 正視眼

source: rownum := A_Index ; Save this for use in the second loop, below.
ja: rownum := A_Index ; 以下、2つ目のループで使用するために保存します。

source: rows beyond the count can still be added.
ja: を超える行を追加することができます。

source: same as TBS_LEFT.
ja: TBS_LEFTと同じ。

source: sc.Run("Example", var) ; Pass the VT_BYREF ComValue itself, no [] or .ref.
ja: sc.Run("Example", var) ; VT_BYREF ComValueそのものを渡す。[] や .ref は使わない。

source: sc.Run("Example", vref) ; sc should be initialized as in the example below.
ja: sc.Run("Example", vref) ; scは、以下の例のように初期化する必要があります。

source: sends the left virtual key rather than the neutral one)
ja: 中立キーではなく、左の仮想キーを送信します。）

source: sends the neutral virtual key but the left scan code)
ja: はニュートラルバーチャルキーを送信しますが、左のスキャンコード)

source: small-icon and/or large-icon.
ja: small-iconおよびlarge-iconのいずれか、または両方を使用します。

source: sometimes there are wm_command messages saying 'win activated' or 'win destroyed' and other stuff.. not needed.
ja: 時々、wm_commandに'win activated'とか'win destroyed'とかいうメッセージが出る。

source: space
ja: スペース

source: space (A_Space or `s), tab (A_Tab or `t), linefeed (`n), return (`r), vertical tab (`v), and formfeed (`f).
ja: スペース（A_Spaceまたは `s）、タブ（A_Tabまたは `t）、ラインフィード（`n）、リターン（`r）、垂直タブ（`v）、フォームフィード（`f）。

source: spaces, tabs, plus signs, minus signs, decimal points, hexadecimal digits, and the 0x prefix.
ja: スペース、タブ、プラス記号、マイナス記号、小数点、16進数、0xの接頭辞。

source: static FirstCallToUs := true ; Each static declaration's initializer still runs only once.
ja: static FirstCallToUs := true ; 静的宣言のイニシャライザは一度だけ実行されます。

source: stdout.Read(0) ; Flush the write buffer.
ja: stdout.Read(0) ; 書き込みバッファをフラッシュします。

source: str := StrGet(buf, "cp0") ; Retrieve ANSI string from buffer.
ja: str := StrGet(buf, "cp0") ; バッファからANSI文字列を取得します。

source: string, number or object.
ja: 文字列、数値、オブジェクトのいずれかを指定します。

source: t := tick ; This is okay because t isn't captured above.
ja: t := tick ; これは、tが上で捕捉されていないので、大丈夫です。

source: tab (the more typical horizontal variety)
ja: タブ

source: that is to say, a work containing the Program or a portion of it, either verbatim or with modifications and/or translated into another language.
ja: すなわち、『プログラム』またはその一部をそのまま、あるいは改変を加えて、および/または別の言語に翻訳して含む著作物。

source: the Run function might support different CLSIDs depending on system configuration.
ja: 実行機能は、システム構成によって異なるCLSIDをサポートする場合があります。

source: the OperateOnFolders? and Recurse? parameters have been replaced with a single Mode parameter identical to that of Loop Files.
ja: OperateOnFolders?とRecurse?のパラメータは、Loop Filesと同じ1つのModeパラメータに置き換えられました。

source: the AutoHotkey interpreter, the script, any files it includes, and any files it has incorporated via the FileInstall function.
ja: AutoHotkeyインタープリタ、スクリプト、スクリプトに含まれるファイル、FileInstall関数で取り込んだファイル。

source: the X or Y position is omitted and the control's position could not be determined.
ja: の場合、X または Y の位置が省略され、コントロールの位置を決定することができなかった。

source: the default mode, and text mode, where the fourth parameter was the word Text.
ja: というデフォルトのモードと、4番目のパラメータがTextという単語であるテキストモードがあります。

source: the last occurrence that sets a given warning determines the mode for that warning.
ja: ある予告を設定した最後の発生で、その予告のモードが決定されます。

source: the new syntax added in v1.1.21+ is now the only syntax.
ja: v1.1.21+で追加された新しい構文が唯一の構文となりました。

source: the one-based index of a parameter.
ja: パラメータの1ベースインデックス。

source: the pattern contains a syntax error; or
ja: パターンに構文エラーがある場合。

source: the program couldn't be launched.
ja: と表示され、プログラムが起動できませんでした。

source: the variable will auto-expand if the script assigns it a larger value later.
ja: この変数は、スクリプトが後で大きな値を代入した場合に自動的に拡張されます。

source: the window must have +Resize to allow resizing by the user.
ja: の場合、ユーザーによるサイズ変更を可能にするために、ウィンドウには+Resizeが必要です。

source: the_language := LCID[A_Language] ; Get the name of the system's default language.
ja: the_language := LCID[A_Language] ; システムの既定の言語を取得します。

source: their names and current contents.
ja: その名前と現在の内容です。

source: there are no commands in v2, just functions.
ja: v2にはコマンドはなく、関数だけです。

source: these are similar to xm and ym except that they refer to coordinates that were saved by having previously added a control with the word Section in its options (the first control of the window always starts a new section, even if that word isn't specified in its options).
ja: これらはxmと ymに似ていますが、オプションにSectionという単語を持つコントロールを事前に追加して保存した座標を参照する点が異なります（ウィンドウの最初のコントロールは、オプションにその単語が指定されていなくても、常に新しいセクションを開始します）。

source: they are in effect for all windows.
ja: これらはすべてのウィンドウで有効です。

source: they can interrupt or be interrupted by another thread, such as a hotkey subroutine.
ja: ホットキーのサブルーチンなど、他のスレッドに割り込んだり、割り込まれたりする可能性があります。

source: they yield 1 for true and 0 for false.
ja: 真なら1、偽なら0となる。

source: time := DateDiff(time, A_LoopFileTimeModified, "Seconds") ; Subtract the source file's time from the destination's.
ja: time := DateDiff(time, A_LoopFileTimeModified, "Seconds") ; 送信元ファイルの時刻と送信先ファイルの時刻を引き算します。

source: to produce it literally, use four consecutive single quotes (''''), or just two if the quote is already inside an outer pair of quotes.
ja: を文字通りに表示するには、4つの連続した単一引用符（'''）を使用します（引用符がすでに外側の引用符のペアの中にある場合は2つだけ）。

source: to specify the exact type. For instance, 0x2003 identifies a SAFEARRAY
ja: で、正確な型を指定します。例えば、0x2003は、SAFEARRAYを識別します。

source: tray := A_TrayMenu ; For convenience.
ja: tray := A_TrayMenu ; 便宜上

source: tray.Enable "TestToggleEnable" ; Also enables the next test since it can't undo the disabling of itself.
ja: tray.Enable "TestToggleEnable" ; 自分自身の無効化を取り消すことができないので、次のテストも有効にします。

source: tray.delete ; Delete the standard items.
ja: tray.delete ;標準の項目を削除する。

source: try FileDelete FTPCommandFile ; In case previous run was terminated prematurely.
ja: try FileDelete FTPCommandFile ; 前回実行したプログラムが途中で終了してしまった場合。

source: unless you use the "Join" option.
ja: 「Join」オプションを使用しない限り。

source: v1 Name
ja: v1の名前

source: v1: MsgBox, with comma, MsgBox % "no end percent" and Legacy = assignment.
ja: v1：MsgBox, カンマ付き、MsgBox % "ノーエンドパーセント"、レガシー = 割り当て。

source: v1: Multi-line hotkeys without braces or a function definition.
ja: v1：中括弧や関数定義のない複数行のホットキー。

source: v2 Name
ja: v2の名前

source: v2 disables this caching, so that str := "123" is always a string and int := 123 is always an integer.
ja: v2はこのキャッシュを無効にするため、str := "123"は常に文字列、int := 123は常に整数になります。

source: v2.0 release candidates
ja: v2.0リリース候補

source: v2.0 uses expression syntax exclusively and as such has no need for any special handling of commas.
ja: v2.0は式構文のみを使用するため、カンマを特別に扱う必要がありません。

source: v2.0-alpha releases
ja: v2.0アルファ版リリース

source: v2.0-beta releases
ja: v2.0ベータ版リリース

source: v2.0-beta.4 and later include an installation script.
ja: v2.0-beta.4以降にはインストールスクリプトが含まれています。

source: v2: Unambiguous use of continuation by enclosure or end-of-line continuation operators.
ja: v2：囲みまたは行末の継続演算子による継続の明確な使用。

source: v2: Unambiguous use of 'single quotes' or fat arrow => in an expression.
ja: v2：式の中で'一重引用符'または太い矢印=>を明確に使用する。

source: value}, but since plain objects now only have "properties" and not "array elements", the rules have changed slightly for consistency with how properties are accessed in other contexts:
ja: value}です。しかし、プレーンオブジェクトは現在「配列要素」ではなく「プロパティ」しか持たないため、他のコンテキストでプロパティにアクセスする方法との一貫性を保つために、ルールが少し変更されました：

source: var := ComValue(0x400C, variant_buf.ptr) ; Make a reference to a VARIANT.
ja: var := ComValue(0x400C, variant_buf.ptr) ; VARIANTへの参照を行う。

source: variant_buf := Buffer(24, 0) ; Make a buffer big enough for a VARIANT.
ja: variant_buf := Buffer(24, 0) ; VARIANTのために十分な大きさのバッファを作成します。

source: vertical tab -- corresponds to Ascii value 11.
ja: vertical tab -- Ascii値11に対応。

source: vref := ComValue(0x400C, vbuf.ptr) ; 0x400C is a combination of VT_BYREF and VT_VARIANT.
ja: vref := ComValue(0x400C, vbuf.ptr) ; 0x400C は、VT_BYREF と VT_VARIANT の組み合わせです。

source: x := "inner value" ; Creates a variable local to inner
ja: x := "inner value" ; innerのローカルに変数を作成します。

source: x+n or xp+nonzero
ja: x+n または xp+nonzero

source: xn or xm
ja: xn または xm

source: xp or xp+0
ja: xp または xp+0

source: y+n or yp+nonzero
ja: y+n または yp+nonzero

source: yn or ym
ja: yn または ym

source: y?}, the property is not assigned.
ja: y?}など）の場合、プロパティは付与されない。

source: yp or yp+0
ja: yp または yp+0

source: { ... } (Block)
ja: { ... }（ブロック）

source: {...} (block)
ja: {...} （ブロック）

source: {...} (block) - Syntax & Usage | AutoHotkey v2
ja: {...}（ブロック）- 構文と使用法｜AutoHotkey v2

source: {Backspace} or {BS}
ja: {Backspace}または{BS}

source: {Control down} or {Ctrl down}
ja: {Control down}または{Ctrl down}

source: {Control} or {Ctrl}
ja: {Control}または{Ctrl}

source: {Delete} or {Del}
ja: {Delete}または{Del}

source: {Escape} or {Esc}
ja: {Escape}または{Esc}

source: {F12} is F12.
ja: {F12} は F12.

source: {Insert} or {Ins}
ja: {Insert}または{Ins}

source: {LControl} or {LCtrl}
ja: {LControl}または{LCtrl}

source: {Numpad5} is 5.
ja: {Numpad5} は 5。

source: {RControl} or {RCtrl}
ja: {RControl}または{RCtrl}

source: } ; These braces are now required, otherwise else associates with while
ja: } ; これらの中括弧は現在必須であり、そうでなければ else は while と関連付けられる。

source: } ; This brace marks the end of the hotkey.
ja: } ; この中括弧はホットキーの終了を示します。

source: ~*Esc::Send "{Alt up}" ; When the menu is cancelled, release the Alt key automatically.
ja: ~*Esc::Send "{Alt up}" ; メニューがキャンセルされたときは、自動的にAltキーを離します。

source: ~LControl & WheelDown:: ; Scroll right.
ja: ~LControl & WheelDown:: ; 右にスクロールします。

source: ~LControl & WheelUp:: ; Scroll left.
ja: ~LControl & WheelUp:: ; 左にスクロールします。

source: ~Tilde affects how custom modifier keys work
ja: ~Tildeは、カスタムモディファイアキーの動作に影響を与えます

source: ~Tilde and Custom Combination Hotkeys
ja: ~ティルデとカスタムコンビネーションホットキー

source: Encoding
ja: エンコード

source: Values
ja: 値

source: Symbol
ja: 記号

source: Name
ja: 名前

source: Type
ja: 型

source: Value
ja: 値

source: No
ja: いいえ

source: Yes
ja: はい

source: Expression
ja: 式

source: Var
ja: 変数

source: Timeout
ja: タイムアウト

source: Flag
ja: フラグ

source: Class
ja: クラス

source: Function
ja: 関数

source: Add
ja: 追加

source: Remove
ja: 取り除く

source: Toggle
ja: トグル

source: Format
ja: フォーマット

source: Number
ja: 数

source: Mode
ja: モード

source: Options
ja: オプション

source: Key
ja: キー

source: Prop
ja: プロパティ

source: Property
ja: プロパティ

source: Style
ja: スタイル

source: Hidden
ja: 非表示

source: Index
ja: 索引

source: Control
ja: コントロール

source: Default
ja: デフォルト

source: Text
ja: テキスト
